snlkuharlocal/src/Documents/ХранилищеКодовМаркировки/ХранилищеКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ХранилищеКодовМаркировки</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ОтчетКассовойСмены</basedOn>
  <basedOn>Document.СписаниеТМЦ</basedOn>
  <basedOn>Document.ЗаданиеНаМаркировку</basedOn>
  <basedOn>Document.ПередачаКодовМаркировкиМП</basedOn>
  <basedOn>Document.ЗаданиеНаСборкуКомплектовЧЗ</basedOn>
  <basedOn>Document.РекламационнаяНакладная</basedOn>
  <basedOn>Document.МаркировкаОстатковТЦ</basedOn>
  <basedOn>Document.Претензия</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратОтПокупателя</types>
      <types>DocumentRef.ОтчетКассовойСмены</types>
      <types>DocumentRef.ВыкупИМ</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.Возврат1ИМ</types>
      <types>DocumentRef.МаркировкаОстатковТЦ</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.ПередачаКодовМаркировкиМП</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Претензия</types>
      <types>DocumentRef.ЗаказИМ</types>
      <types>DocumentRef.ОприходованиеТМЦ</types>
      <types>DocumentRef.СписаниеТМЦ</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
      <types>DocumentRef.ВозвратИМ</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУзлаСоздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистНабора</name>
    <type>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГрупповыхКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоШтучныхКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланФакт</name>
    <type>
      <types>EnumRef.ПланФакт</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель_Карантин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель_Карантин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.СкладскиеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоШтуквХКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>EnumRef.СкладскиеОперации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодНабора</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>EnumRef.СкладскиеОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>КодКомплектующегоНеНанесен</name>
      <comment>Не нанесен</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/ОтгружаемыеКодыМаркировки/ОтгружаемыеКодыМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтгружаемыеКодыМаркировки</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ХранилищеКодовМаркировки</types>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.ЛистНабора</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКомпьютера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт/СтатусыКМ_Факт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт_А/СтатусыКМ_Факт_А.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт_А</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/AccumulationRegisters/ОстаткиДоступныхКМ/ОстаткиДоступныхКМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиДоступныхКМ</name>
  <resources>
    <name>ЭмитированноКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоступноКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Нанесен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/ПланФакт/ПланФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПланФакт</name>
  <enumValues>
    <name>План</name>
  </enumValues>
  <enumValues>
    <name>Факт</name>
  </enumValues>
  <enumValues>
    <name>ПланКорректировка</name>
  </enumValues>
  <enumValues>
    <name>БизнесПлан</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СкладскиеОперации/СкладскиеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СкладскиеОперации</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПриемка</name>
    <comment>Для шапок ОКС с возвратами</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыКодовМаркировкиФакт/СтатусыКодовМаркировкиФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКодовМаркировкиФакт</name>
  <enumValues>
    <name>Эмитирован</name>
  </enumValues>
  <enumValues>
    <name>ПереданПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ГотовКПечати</name>
  </enumValues>
  <enumValues>
    <name>Распечатан</name>
  </enumValues>
  <enumValues>
    <name>Нанесен</name>
  </enumValues>
  <enumValues>
    <name>НанесенВиртуально</name>
  </enumValues>
  <enumValues>
    <name>Вложен</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>ВОбороте</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>Списан</name>
  </enumValues>
  <enumValues>
    <name>ВозвращенПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ЗакупленВРФ</name>
  </enumValues>
  <enumValues>
    <name>Выбыл</name>
  </enumValues>
  <enumValues>
    <name>Зарезервирован</name>
  </enumValues>
  <enumValues>
    <name>Расформирован</name>
  </enumValues>
  <enumValues>
    <name>ВнутренняяАгрегация</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыРекламаций/ВидыРекламаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРекламаций</name>
  <enumValues>
    <name>Рекламация</name>
  </enumValues>
  <enumValues>
    <name>Вычерк</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ХранилищеКодовМаркировки/ObjectModule.bsl
#Область СобытияДокумента


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)	
	Автор 			 = ПараметрыСеанса.Пользователь;
	ТипОснования	 = ТипЗнч(ДанныеЗаполнения);
		
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ДокОснование 	= МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеЗаполнения, "ДокОснование");
		ТолькоШапка		= МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеЗаполнения, "ТолькоШапка", Ложь);
	Иначе		
		ДокОснование 	= ДанныеЗаполнения;		
		ТолькоШапка		= Ложь;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ДокОснование) Тогда Возврат КонецЕсли;
	
	Организация = ПолучитьРеквизитШапки(ДокОснование, "Организация");
	
	ЗаполнитьОтправителяПолучателя();
	
	Если ТипОснования = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ПланФакт	= Перечисления.ПланФакт.Факт;
		Операция	= Перечисления.СкладскиеОперации.Приемка;
		Если ТолькоШапка Тогда Возврат КонецЕсли;
		
		ЗаполнитьПоЗПС_Импорт(ДокОснование)
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		ПланФакт	= Перечисления.ПланФакт.Факт;
		
		Операция = Перечисления.СкладскиеОперации.Приемка;
		Если ТолькоШапка Тогда Возврат КонецЕсли;		
		
		ЗаполнитьПоЛНкНакладной(ДокОснование);
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		ПланФакт = Перечисления.ПланФакт.Факт;
		Операция	= Перечисления.СкладскиеОперации.Отгрузка;
		Если ТолькоШапка Тогда Возврат КонецЕсли; 
		
		ЗаполнитьПоЛНкНакладной(ДокОснование);
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.Перемещение") Тогда
		рШапки = ПолучитьРеквизитыШапки(ДокОснование, "Склад.КодФизическогоУзла,СкладПолучатель.КодФизическогоУзла", "Документ");		
		
		// Кухарь А.Ю. 27.12.2024 начало
		//
		если рШапки.Склад_КодФизическогоУзла="" тогда
			рШапки.Склад_КодФизическогоУзла="SNL";
		КонецЕсли;
		если рШапки.СкладПолучатель_КодФизическогоУзла="" тогда
			рШапки.СкладПолучатель_КодФизическогоУзла="SNL";
		КонецЕсли;
		
		// Кухарь А.Ю. 27.12.2024 конец
		
		Если ОбщегоНазначения_ПИ.ЭтотУзелКод("Основной") = рШапки.Склад_КодФизическогоУзла Тогда
			ПланФакт = Перечисления.ПланФакт.Факт;
			Операция = Перечисления.СкладскиеОперации.Отгрузка;
		ИначеЕсли ОбщегоНазначения_ПИ.ЭтотУзелКод("Основной") = рШапки.СкладПолучатель_КодФизическогоУзла Тогда			
			ПланФакт = Перечисления.ПланФакт.Факт;		
			Операция = Перечисления.СкладскиеОперации.Приемка;	
		Иначе
			Сообщить("ХКМ создаются только на складе отправителе или получателе !", СтатусСообщения.Важное);
		КонецЕсли;
		
		Если ТолькоШапка Тогда Возврат КонецЕсли; 
		
		ЗаполнитьПоЛНкНакладной(ДокОснование);
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.СписаниеТМЦ") Тогда
		ПланФакт = Перечисления.ПланФакт.Факт;
		Операция = Перечисления.СкладскиеОперации.Отгрузка;
		Если ТолькоШапка Тогда Возврат КонецЕсли;
		
		ЗаполнитьПоЛНкНакладной(ДокОснование);
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаданиеНаМаркировку") Тогда
		ПланФакт = Перечисления.ПланФакт.Факт;
		Операция = Перечисления.СкладскиеОперации.ОтгрузкаПриемка;
		Если ТолькоШапка Тогда Возврат КонецЕсли;
		
		ЗаполнитьПоЗаданиюНаМаркировку(ДокОснование);
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаданиеНаСборкуКомплектовЧЗ") Тогда
		ПланФакт = Перечисления.ПланФакт.Факт;
		Операция = Перечисления.СкладскиеОперации.Приемка;
		Если ТолькоШапка Тогда Возврат КонецЕсли;
		
		ЗаполнитьПоЗаданиюНаСборку(ДокОснование);
	КонецЕсли;	
КонецПроцедуры

//+++Чирков 17.03.2026
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
	рПроверки = лМожноЗаписатьДокумент();
	Если Не рПроверки.Успешно Тогда
		ТекстОшибки = СтрСоединить(рПроверки.Ошибки, Символы.ПС);
		ЗаписатьВЛог("ОбменДанными", ТекстОшибки, "Ошибка");
		Отказ = Истина;                         
		ВызватьИсключение ТекстОшибки;
		Возврат;
	КонецЕсли; 
			
	Если ЭтоНовый() Тогда
		КодУзлаСоздания = Маркировка_ПИ.ЭтотУзел_Код();		
	КонецЕсли;
		
	ЕстьИзменения	= Модифицированность();
	Если ЕстьИзменения Тогда	
		ЗаполнитьКоличестваКМ();	
		ЗаполнитьТовары();
	КонецЕсли; 
	
	НужноВыгружать	= НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	ДополнительныеСвойства.Вставить("НужноВыгружать", НужноВыгружать);
	
	Если КодОперации.Пустая() И ЗначениеЗаполнено(ДокОснование) И ЕстьРеквизитДокумента("КодОперации", ДокОснование.Метаданные()) Тогда
		КодОперации = ПолучитьРеквизитШапки(ДокОснование, "КодОперации");
	КонецЕсли; 
		
	Если НужноВыгружать Тогда
		Документы.ХранилищеКодовМаркировки.УстановитьПолучателейИзменений(ЭтотОбъект);		
	КонецЕсли;
			
КонецПроцедуры
//---Чирков 17.03.2026

Процедура ПриЗаписи(Отказ)
	Если Проведен И (ЭтоЗавершенныйВозврат() ИЛИ ЭтоПринятоеПеремещение()) Тогда
		РегистрыСведений.ОтгружаемыеКодыМаркировки.СоздатьЗадачуОчисткиОтгружаемыхКМДокумента(Ссылка);			
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	КодУзлаСоздания = ОбщегоНазначения_ПИ.ЭтотУзелКод("Основной");
	Автор 			= ПараметрыСеанса.Пользователь;
	
	ШтрихкодыУпаковок.Очистить();
	Товары.Очистить();
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = Маркировка_ПИ.ЭтотУзел_Код("Основной")+"-";
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	
	СтатусКМ 		= Неопределено;	
	Местонахождение = Неопределено;	
	ВПути			= Ложь;
	
	Движения.СтатусыКМ_Факт.Очистить();
	Движения.СтатусыКМ_Факт_А.Очистить();
	
	Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Если ПланФакт = Перечисления.ПланФакт.Факт Тогда
		КонецЕсли;		
	ИначеЕсли ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		Если ПланФакт = Перечисления.ПланФакт.Факт Тогда
			СтатусКМ = Перечисления.СтатусыКодовМаркировкиФакт.ВОбороте;
			рШапки = ПолучитьРеквизитыШапки(ДокОснование, "Склад,Склад.ФизическийСклад,КодОперации,ДокОснование");		
			Местонахождение = ?(ЗначениеЗаполнено(рШапки.Склад_ФизическийСклад), рШапки.Склад_ФизическийСклад, рШапки.Склад);			
			Местонахождение = Маркировка_ПИ.ФизическоеПодразделениеСклада(Местонахождение);

			рМестоПоложения = ПолучитьРеквизитыШапки(рШапки.Склад, "СкладБухгалтерии,КарантинЧЗ");

			Если рМестоПоложения.КарантинЧЗ тогда
				//++Данилова Е.В. 16.12.2025 MARK-3378 
				СтатусКМ = Перечисления.СтатусыКодовМаркировкиФакт.Карантин;
				//--Данилова Е.В. 16.12.2025 
			Иначе								
				Местонахождение = Получатель;				
			КонецЕсли;
		ИначеЕсли ПланФакт = Перечисления.ПланФакт.План Тогда
			
		КонецЕсли;		
	ИначеЕсли ТипЗнч(ДокОснование) = Тип("ДокументСсылка.РасходнаяНакладная") 

	Тогда
		СтатусКМ		= Перечисления.СтатусыКодовМаркировкиФакт.ОтгруженПокупателю;		
		Местонахождение = Получатель;
	ИначеЕсли ТипЗнч(ДокОснование) = Тип("ДокументСсылка.Перемещение") Тогда		
		рШапки 			= ПолучитьРеквизитыШапки(ДокОснование, "СкладПолучатель");
		Местонахождение = Получатель;
		
		Если ЭтоСкладКарантина(рШапки.СкладПолучатель) Тогда                        
			СтатусКМ = Перечисления.СтатусыКодовМаркировкиФакт.Карантин;		
		Иначе
			СтатусКМ = Перечисления.СтатусыКодовМаркировкиФакт.ВОбороте;
		КонецЕсли;
		
		ВПути = (Операция = Перечисления.СкладскиеОперации.Отгрузка);		
	ИначеЕсли ТипЗнч(ДокОснование) = Тип("ДокументСсылка.СписаниеТМЦ") Тогда		
		рШапки = ПолучитьРеквизитыШапки(ДокОснование, "СтатьяЗатрат");
		Местонахождение = рШапки.СтатьяЗатрат;
		
		СтатусКМ = Перечисления.СтатусыКодовМаркировкиФакт.Списан;
	ИначеЕсли ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ЗаданиеНаМаркировку") Тогда		
		рШапки = ПолучитьРеквизитыШапки(ДокОснование, "Подразделение");
		Местонахождение = Получатель;
		
		Если КодУзлаСоздания<>Маркировка_ПИ.ЭтотУзел_Код() Тогда
			СтатусКМ = Перечисления.СтатусыКодовМаркировкиФакт.Нанесен;			
		КонецЕсли;	
	ИначеЕсли ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ОтчетКассовойСмены") Тогда 
		Если Операция = Перечисления.СкладскиеОперации.Приемка Тогда			
			СтатусКМ = Перечисления.СтатусыКодовМаркировкиФакт.ВОбороте;
			Местонахождение = Получатель;
		Иначе
			//+20251113 корр. Михайловский
			//СтатусКМ = Перечисления.СтатусыКодовМаркировкиФакт.ОтгруженПокупателю;
			СтатусКМ = Перечисления.СтатусыКодовМаркировкиФакт.Выбыл;  
			//-20251113 корр. Михайловский
			Местонахождение = Получатель;			
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокОснование) = Тип("ДокументСсылка.РекламационнаяНакладная") Тогда 
		Если Операция = Перечисления.СкладскиеОперации.Приемка Тогда			
			СтатусКМ = Перечисления.СтатусыКодовМаркировкиФакт.ВОбороте;
			Местонахождение = Получатель;
		Иначе
			//+HELP-7109 20251112 Михайловский
			//СтатусКМ = Перечисления.СтатусыКодовМаркировкиФакт.ОтгруженПокупателю; 
			СтатусКМ = ?(ТипЗнч(ДокОснование.ДокОснование) = Тип("ДокументСсылка.ПриходнаяНакладная"), Перечисления.СтатусыКодовМаркировкиФакт.ВозвращенПоставщику, Перечисления.СтатусыКодовМаркировкиФакт.ОтгруженПокупателю);
			//-HELP-7109 20251112 Михайловский
			Местонахождение = Получатель;			
		КонецЕсли;
    //Валетов + 09,07,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5737
	ИначеЕсли ТипЗнч(ДокОснование) = Тип("ДокументСсылка.МаркировкаОстатковТЦ") Тогда
		СтатусКМ		= Перечисления.СтатусыКодовМаркировкиФакт.ВОбороте;		
		Местонахождение = Получатель;
	//Валетов -	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(СтатусКМ) Тогда
		НЗ = Движения.СтатусыКМ_Факт;
		
		//ТЧ                                     
		
		Для Каждого СтрокаШК Из ПолучитьТаблицуШК(Ссылка) Цикл
			Движение = НЗ.Добавить();
				
			Движение.Период 			= Дата;
			
			Движение.ШтрихКодУпаковки	= СтрокаШК.ШтрихкодУпаковки;
			Движение.Номенклатура		= СтрокаШК.Номенклатура;
			Движение.ТипШК				= СтрокаШК.ТипШК;
			
			//Валетов+ 01,11,2024 Для ХКМ к ОКС.Движения будут зависеть от Значения Операция в ТЧ ШтрихкодыУпаковок, а для начала заполним СтатусКМ
			Если ЗначениеЗаполнено(СтрокаШК.Операция) И ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ОтчетКассовойСмены") Тогда
				Если СтрокаШК.Операция = Перечисления.СкладскиеОперации.Отгрузка Тогда
					Движение.Статус			= СтатусКМ;			
				Иначе
					Движение.Статус			= Перечисления.СтатусыКодовМаркировкиФакт.ВОбороте;					
				КонецЕсли;
				
				Движение.Местонахождение	= Местонахождение;
				Движение.ВПути				= ВПути;
			//Валетов + 22,02,2025
			//ПУСТАЯ ЗАДАЧА Добавление движения ХКМ для РКМ с пересортом. Одна КМ "+" на склад, вторая "-" покупателю. 
			ИначеЕсли ЗначениеЗаполнено(СтрокаШК.Операция) И ТипЗнч(ДокОснование) = Тип("ДокументСсылка.РекламационнаяНакладная") Тогда
				
				Если СтрокаШК.Операция = Перечисления.СкладскиеОперации.Отгрузка Тогда
					//+HELP-7109 20251112 Михайловский
					//Движение.Статус			= Перечисления.СтатусыКодовМаркировкиФакт.ОтгруженПокупателю;
			   		Движение.Статус = ?(ТипЗнч(ДокОснование.ДокОснование) = Тип("ДокументСсылка.ПриходнаяНакладная"), Перечисления.СтатусыКодовМаркировкиФакт.ВозвращенПоставщику, Перечисления.СтатусыКодовМаркировкиФакт.ОтгруженПокупателю);
					//Местонахождение			= Отправитель;
					//-HELP-7109 20251112 Михайловский
				Иначе
					Движение.Статус			= Перечисления.СтатусыКодовМаркировкиФакт.ВОбороте;
				КонецЕсли;
				Движение.Местонахождение	= Местонахождение;
				Движение.ВПути				= ВПути;
			Иначе
			//Валетов- 01,11,2024
				Движение.Статус				= СтатусКМ;			
				Движение.Местонахождение	= Местонахождение;
				Движение.ВПути				= ВПути;
			КонецЕсли;
			
			//+++Чирков 21.08.2025 выравнивание движений по статусам в регистрах штук и коробок
			Если СтрокаШК.ТипШК <> Перечисления.ТипыШтрихКодов.Штука Тогда
				Движение_Кор = Движения.СтатусыКМ_Факт_А.Добавить();
				ЗаполнитьЗначенияСвойств(Движение_Кор, Движение);
				
				Движение_Кор.СпособВводаВОборот = СтрокаШК.СпособВводаВОборот;
				//+++Чирков 01.12.2025 ТипУпаковки - убираем
				//Движение_Кор.ТипУпаковки 		= СтрокаШК.ТипУпаковки;
				//---Чирков 01.12.2025
			КонецЕсли;			
			//---Чирков 21.08.2025 выравнивание движений по статусам в регистрах штук и коробок
		КонецЦикла;	
		
		//Вложенные коды
		ВложенныеКоды = ПолучитьВыборкуВложенныхКодов();
		Для Каждого СтрокаК Из ВложенныеКоды Цикл		
			Движение = Движения.СтатусыКМ_Факт.Добавить();
			
			Движение.Период 			= Дата;
			
			Движение.ШтрихКодУпаковки	= СтрокаК.ШтрихкодУпаковки;
			Движение.ТипШК				= СтрокаК.ТипШК;
			Движение.Номенклатура		= СтрокаК.Номенклатура;
			
			Движение.Статус				= СтатусКМ;			
			Движение.Местонахождение	= Местонахождение;			
			Движение.ВПути				= ВПути;
			
			//+++Чирков 29.09.2025 выравнивание движений по статусам в регистрах штук и коробок
			Если СтрокаК.ТипШК <> Перечисления.ТипыШтрихКодов.Штука Тогда
				Движение_Кор = Движения.СтатусыКМ_Факт_А.Добавить();
				ЗаполнитьЗначенияСвойств(Движение_Кор, Движение);
				
				Движение_Кор.СпособВводаВОборот = СтрокаК.СпособВводаВОборот;
				//+++Чирков 01.12.2025 ТипУпаковки - убираем
				//Движение_Кор.ТипУпаковки 		= СтрокаК.ТипУпаковки;
				//---Чирков 01.12.2025
			КонецЕсли;			
			//---Чирков 29.09.2025 выравнивание движений по статусам в регистрах штук и коробок
		КонецЦикла;
		
		//Коды коробок
		тКоробок = МаркировкаС.ПолучитьДанныеКоробок(Ссылка, "ШтрихКодыУпаковок");
		Для Каждого СтрокаКоробки Из тКоробок Цикл			
			Движение = Движения.СтатусыКМ_Факт.Добавить();
			
			Движение.Период 			= Дата;
			
			Движение.ШтрихКодУпаковки	= СтрокаКоробки.ШтрихкодКоробки;
			Движение.ТипШК				= СтрокаКоробки.ТипШК;
			
			Движение.Статус				= СтатусКМ;
			Движение.Местонахождение	= Местонахождение;
			Движение.ВПути				= ВПути;			
			
			//СтатусыКМ_Факт_А
			Движение = Движения.СтатусыКМ_Факт_А.Добавить();
			
			Движение.Период 			= Дата;
			
			Движение.СпособВводаВОборот = СтрокаКоробки.СпособВводаВОборот;	
			Движение.ТипШК				= СтрокаКоробки.ТипШК;
			//+++Чирков 01.12.2025 ТипУпаковки - убираем
			//Движение.ТипУпаковки		= СтрокаКоробки.ТипУпаковки;
			//--Чирков 01.12.2025
			Движение.ШтрихКодУпаковки	= СтрокаКоробки.ШтрихкодКоробки;
			
			Движение.Статус				= СтатусКМ;
			Движение.Местонахождение	= Местонахождение;
			Движение.ВПути				= ВПути;
		КонецЦикла; 
	КонецЕсли;		
	
	Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.РасходнаяНакладная")
		ИЛИ ТипЗнч(ДокОснование) = Тип("ДокументСсылка.Перемещение")
		ИЛИ ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ОприходованиеТМЦ")
		ИЛИ ТипЗнч(ДокОснование) = Тип("ДокументСсылка.СписаниеТМЦ")
		//ИЛИ ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ПриходнаяНакладная")
		ИЛИ ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ОтчетКассовойСмены") Тогда
			
		РасформироватьКоробки(Отправитель);		
	ИначеЕсли ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ЗаданиеНаСборкуКомплектовЧЗ") Тогда
		Если КодУзлаСоздания <> Маркировка_ПИ.ЭтотУзел_Код("Основной") Тогда
			СформироватьДвиженияПоЗСБ();
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ЗаданиеНаМаркировку") Тогда
		Если КодУзлаСоздания <> Маркировка_ПИ.ЭтотУзел_Код("Основной") Тогда
			СформироватьДвиженияПоЗМО();
		КонецЕсли;
	КонецЕсли; 
	
	МаркировкаКС.СохранитьОтложенныеДвижения(ЭтотОбъект, Отказ);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	Движения.СтатусыКМ_Факт.Очистить();
	Движения.СтатусыКМ_Факт_А.Очистить();
	Движения.ОстаткиДоступныхКМ.Очистить();
	
	МаркировкаКС.СохранитьОтложенныеДвижения(ЭтотОбъект, Отказ);	
КонецПроцедуры


#КонецОбласти

//+++Чирков 17.03.2026
Функция ЭтоЗавершенныйВозврат()	
	Результат = Ложь;
	Если НЕ ЗначениеЗаполнено(ДокОснование) Тогда
		Возврат Результат;	
	КонецЕсли;
	
	ТипОснования = ТипЗнч(ДокОснование);
	Если ТипОснования = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		рШапки = ПолучитьРеквизитыШапки(ДокОснование, "Проведен,СостояниеНакладной,КодОперации");
		Если рШапки.Проведен
			И (рШапки.СостояниеНакладной = Перечисления.СостоянияНакладной.Принята)
			И (рШапки.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия ИЛИ рШапки.КодОперации = Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя)
			Тогда
			
			Результат = Истина;		
		КонецЕсли;
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.РекламационнаяНакладная") Тогда                    
		//+++Чирков 24.04.2026
		рШапки = ПолучитьРеквизитыШапки(ДокОснование, "Проведен,ПроводитьПоОстаткам,ВидРекламации");		
		//MARK-3644 необходимо удалять коды из регистра, если к РНК сделан РКМ с видом рекламации "Вычерк". Прочие галочки не учитывать.
		Если рШапки.Проведен И рШапки.ВидРекламации = Перечисления.ВидыРекламаций.Вычерк Тогда      
		//---Чирков 24.04.2026
			Результат = Истина;		
		КонецЕсли;				
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ЭтоЗавершенныйВозврат()
//---Чирков 17.03.2026

//+++Чирков 27.03.2026
Функция ЭтоПринятоеПеремещение()
	Результат = Ложь;
	Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.Перемещение") Тогда
		Если Документы.Перемещение.ВидПеремещения(ДокОснование) = "Входящее" Тогда
			рШапки = ПолучитьРеквизитыШапки(ДокОснование, "СостояниеНакладнойУПолучателя,Проведен");		
			Если рШапки.Проведен И рШапки.СостояниеНакладнойУПолучателя = Перечисления.СостоянияНакладной.Принята Тогда
				Результат = Истина;											
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;                         
	Возврат Результат;
КонецФункции //ЭтоПринятоеПеремещение()
//---Чирков 27.03.2026

Функция ПолучитьТаблицуШК(ДокСсылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки					КАК ШтрихкодУпаковки,
	//+++Чирков 21.08.2025 выравнивание движений по статусам в регистрах штук и коробок	
	|	ШтрихкодУпаковки.СпособВводаВОборот КАК СпособВводаВОборот,
	//---Чирков 21.08.2025 выравнивание движений по статусам в регистрах штук и коробок
	//+++Чирков 29.09.2025 выравнивание движений по статусам в регистрах штук и коробок
	|	ШтрихкодУпаковки.ТипУпаковки		КАК ТипУпаковки,		                   
	//---Чирков 29.09.2025 выравнивание движений по статусам в регистрах штук и коробок	
	|	ШтрихкодУпаковки.ТипШК				КАК ТипШК,
	|	ВЫБОР 
	|		КОГДА ШтрихкодУпаковки.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар) 
	|			ТОГДА ШтрихкодУпаковки.Владелец
	|		КОГДА ШтрихкодУпаковки.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор) 
	|			ТОГДА ШтрихкодУпаковки.Владелец
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)	
	|	КОНЕЦ						КАК Номенклатура,
	|	Операция					КАК Операция,
	|	КодКомплектующегоНеНанесен	КАК КодКомплектующегоНеНанесен
	|ИЗ
	|	" +  ДокСсылка.Метаданные().ПолноеИмя() + ".ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|";	
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции //ПолучитьТаблицуШК(ДокСсылка)

Процедура СформироватьДвиженияПоЗСБ()
	КодыНаборов = Новый Соответствие;
	Для Каждого СтрокаТЧ Из ПолучитьТаблицуШК(Ссылка) Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.ШтрихкодНабора) Тогда
			КодыНаборов[СтрокаТЧ.ШтрихкодНабора] = Истина;
		КонецЕсли;
		
		Если СтрокаТЧ.КодКомплектующегоНеНанесен Тогда		
			Запись = Движения.СтатусыКМ_Факт.Добавить();
			Запись.Период = Дата -1;
			
			Запись.ШтрихКодУпаковки	= СтрокаТЧ.ШтрихкодУпаковки;
			Запись.ТипШК			= СтрокаТЧ.ТипШК;
			Запись.Номенклатура		= СтрокаТЧ.Номенклатура;
			
			Запись.Статус			= Перечисления.СтатусыКодовМаркировкиФакт.НанесенВиртуально;
			Запись.Местонахождение	= Получатель;
		КонецЕсли;
		
		Запись = Движения.СтатусыКМ_Факт.Добавить();
		Запись.Период = Дата;
		
		Запись.ШтрихКодУпаковки	= СтрокаТЧ.ШтрихкодУпаковки;
		Запись.ТипШК			= СтрокаТЧ.ТипШК;
		Запись.Номенклатура		= СтрокаТЧ.Номенклатура;
		
		Запись.Статус			= Перечисления.СтатусыКодовМаркировкиФакт.Вложен;
		Запись.Местонахождение	= Получатель;		
	КонецЦикла;
	
	Для Каждого КиЗ Из КодыНаборов Цикл
		ШтрихкодНабора = КиЗ.Ключ;
		
		Запись = Движения.СтатусыКМ_Факт.Добавить();
		Запись.Период = Дата -1;
		Запись.ШтрихКодУпаковки	= ШтрихкодНабора;
		Запись.Статус			= Перечисления.СтатусыКодовМаркировкиФакт.Нанесен;
		Запись.Местонахождение	= Получатель;
	КонецЦикла;	
КонецПроцедуры

Процедура СформироватьДвиженияПоЗМО()		
	Для Каждого СтрокаШК Из ПолучитьТаблицуШК(Ссылка) Цикл		
		Движение = Движения.СтатусыКМ_Факт.Добавить();
		
		Движение.Период 			= Дата;
		
		Движение.ШтрихКодУпаковки	= СтрокаШК.ШтрихкодУпаковки;
		Движение.ТипШК				= СтрокаШК.ТипШК;
		Движение.Номенклатура		= СтрокаШК.Номенклатура;
		
		Движение.Статус				= Перечисления.СтатусыКодовМаркировкиФакт.Нанесен;
		Движение.Местонахождение	= Получатель;		
		
		//+++Чирков 21.08.2025 выравнивание движений по статусам в регистрах штук и коробок	
		Если СтрокаШК.ТипШК <> Перечисления.ТипыШтрихКодов.Штука Тогда
			Движение_Кор = Движения.СтатусыКМ_Факт_А.Добавить();
			ЗаполнитьЗначенияСвойств(Движение_Кор, Движение);
				
			Движение_Кор.СпособВводаВОборот = СтрокаШК.СпособВводаВОборот;
			//+++Чирков 01.12.2025 ТипУпаковки - убираем
			//Движение_Кор.ТипУпаковки 		= СтрокаШК.ТипУпаковки;
			//---Чирков 01.12.2025
		КонецЕсли;
		//---Чирков 21.08.2025 выравнивание движений по статусам в регистрах штук и коробок	
	КонецЦикла;		
КонецПроцедуры

Функция ЗаполнитьКоличестваКМ() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ШК ИЗ &ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	|;
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки.ТипКода КАК ТипКода,
	|	СУММА(1) КАК Количество
	|ИЗ
	|	ВТ_ШК	
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодУпаковки.ТипКода	
	|";
	
	Запрос.УстановитьПараметр("ШтрихкодыУпаковок", ШтрихкодыУпаковок);
	Выборка = Запрос.Выполнить().Выбрать();
	
	КоличествоГрупповыхКМ	= 0;
	КоличествоШтучныхКМ	    = 0;
	
	Пока Выборка.Следующий() Цикл		
		Если Выборка.ТипКода = Перечисления.ТипыКодовМаркировки.АТК Тогда
			//АТК тут вообще делать нечего, по идее ....
		ИначеЕсли Выборка.ТипКода = Перечисления.ТипыКодовМаркировки.ЛогистическаяУпаковка Тогда
			КоличествоГрупповыхКМ = Выборка.Количество;
		Иначе
			КоличествоШтучныхКМ = Выборка.Количество;	
		КонецЕсли;
	КонецЦикла;
	
	КоличествоДокумента = КоличествоГрупповыхКМ + КоличествоШтучныхКМ;
КонецФункции //ЗаполнитьКоличстваКМ()

Функция ЗаполнитьПоЗПС_Импорт(ЗПС_Ссылка) Экспорт	
	РеквизитыШ = ПолучитьРеквизитыШапки(ЗПС_Ссылка, "Склад.Подразделение,Контрагент");
	
	Запрос = Новый Запрос(Документы.ХранилищеКодовМаркировки.ТекстЗапроса_КМ_ЗПС_Импорт_САгрегатами());
	Запрос.УстановитьПараметр("ЗПС_Ссылка", ЗПС_Ссылка);
	Запрос.УстановитьПараметр("ТекущийХКМ",	Ссылка);
	
	ШтрихкодыУпаковок.Очистить();
	
	рЗапроса	= Запрос.Выполнить();
	
	ВсегоКодов	= 0; 
	МаксКолНаДокумент = 90000;
	
	Выборка_Модель = рЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Модель");
	Пока Выборка_Модель.Следующий() Цикл
		Выборка_Номенклатура = Выборка_Модель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");
		Пока Выборка_Номенклатура.Следующий() Цикл
			Выборка 	= Выборка_Номенклатура.Выбрать();
			ВсегоКодов 	= ВсегоКодов + Выборка.Количество();			
			
			Если ВсегоКодов < МаксКолНаДокумент Тогда
				Пока Выборка.Следующий() Цикл
					СтрокаТЧ = ШтрихкодыУпаковок.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);				
				КонецЦикла;							
			Иначе
				Если ШтрихкодыУпаковок.Количество() = 0 Тогда //Монопозиция с количеством > 100 000 - КРУТО !
					Пока Выборка.Следующий() И ШтрихкодыУпаковок.Количество() < МаксКолНаДокумент Цикл
						СтрокаТЧ = ШтрихкодыУпаковок.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);										
					КонецЦикла;				
				КонецЕсли;
				
				ТекстПредупреждения = СтрШаблон("В заказе более " + Формат(МаксКолНаДокумент, "ЧРГ=' '; ЧГ=3,0") + " кодов маркировки. 
				|В текущий документ добавлено %1 кодов.
				|Запишите текущий документ и оформите еще один (или несколько) ХКМ на оставшиеся коды заказа.
				|", ШтрихкодыУпаковок.Количество());
				
				#ЕСЛИ КЛИЕНТ ТОГДА
				ПоказатьПредупреждение(, ТекстПредупреждения);				
				#ИНАЧЕ
				Сообщить(ТекстПредупреждения, СтатусСообщения.Важное);
				#КОНЕЦЕСЛИ
				
				Возврат ШтрихкодыУпаковок.Количество();
			КонецЕсли; 								
		КонецЦикла; 
	КонецЦикла;	
	
КонецФункции //ЗаполнитьПоЗПС_Импорт(ЗПС_Ссылка) Экспорт

Функция ЗаполнитьПоПНК_Импорт(ПНК_Ссылка) Экспорт
	Запрос = Новый Запрос(Документы.ХранилищеКодовМаркировки.ТекстЗапроса_КМ_ПНК_Импорт_САгрегатами());
	Запрос.УстановитьПараметр("ПНК_Ссылка", ПНК_Ссылка);
	
	ШтрихкодыУпаковок.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() <= 50000 Тогда
		Пока Выборка.Следующий() Цикл
			СтрокаТЧ = ШтрихкодыУпаковок.Добавить();
			СтрокаТЧ.ШтрихкодУпаковки = Выборка.ШтрихкодУпаковки;	
		КонецЦикла;			
	КонецЕсли;	
КонецФункции //ЗаполнитьПоПНК_Импорт(ПНК_Ссылка)

Функция ЗаполнитьПоЛНкНакладной(ДокОтгрузки)
	Запрос = Новый Запрос;
	
	Если Документы.ХранилищеКодовМаркировки.ЕстьЛистыПереукладки(ДокОтгрузки) Тогда
		Запрос.Текст = Документы.ХранилищеКодовМаркировки.ТекстЗапроса_КМ_ПоДокументуОтгрузки_ЛП();
	Иначе
		Запрос.Текст = Документы.ХранилищеКодовМаркировки.ТекстЗапроса_КМ_ПоДокументуОтгрузки_ЛН();
	КонецЕсли;
	
	Запрос.Параметры.Вставить("ДокОтгрузки", ДокОтгрузки);

	// Кухарь А.Ю.  16.06.2025 начало    
	// падало с ошибкой после добавления в ТекстЗапроса_КМ_ПоДокументуОтгрузки_ЛН параметра &РазворачиватьАгрегациюДоШтук
	ПравилаРаботыСАгрегациейЧЗ=МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(ДокОтгрузки);
	Запрос.Параметры.Вставить("РазворачиватьАгрегациюДоШтук", ПравилаРаботыСАгрегациейЧЗ.РазворачиватьАгрегациюДоШтук);
	// Кухарь А.Ю.  16.06.2025 конец
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() <= 75000 Тогда
		Пока Выборка.Следующий() Цикл
			СтрокаТЧ = ШтрихкодыУпаковок.Добавить();
			СтрокаТЧ.ШтрихкодУпаковки = Выборка.ШтрихкодУпаковки;	
		КонецЦикла;			
	КонецЕсли;	
КонецФункции //ЗаполнитьПоЛНкНакладной(ДокОтгрузки)

Функция ЗаполнитьПоЛПкНакладной(ДокОтгрузки)
	Запрос = Новый Запрос(Документы.ХранилищеКодовМаркировки.ТекстЗапроса_КМ_ПоДокументуОтгрузки_ЛН());
	Запрос.УстановитьПараметр("ДокОтгрузки", ДокОтгрузки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() <= 75000 Тогда
		Пока Выборка.Следующий() Цикл
			СтрокаТЧ = ШтрихкодыУпаковок.Добавить();
			СтрокаТЧ.ШтрихкодУпаковки = Выборка.ШтрихкодУпаковки;	
		КонецЦикла;			
	КонецЕсли;	
КонецФункции //ЗаполнитьПоПНК_Импорт(ПНК_Ссылка)

Функция ЗаполнитьПоЗаданиюНаМаркировку(ДокОтгрузки)
	Запрос = Новый Запрос(Документы.ХранилищеКодовМаркировки.ТекстЗапроса_КМ_ПоЗаданиеНаМаркировку());
	Запрос.УстановитьПараметр("ДокОтгрузки", ДокОтгрузки);
	Если ЗначениеЗаполнено(ДокОтгрузки) И ТипЗнч(ДокОтгрузки) = Тип("ДокументСсылка.ЗаданиеНаМаркировку") Тогда
		Накладная = ПолучитьРеквизитШапки(ДокОтгрузки, "ДокОснование");
		Если ТипЗнч(Накладная) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
			Операция = Перечисления.СкладскиеОперации.Отгрузка;		
		КонецЕсли; 
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() <= 75000 Тогда
		Пока Выборка.Следующий() Цикл
			СтрокаТЧ = ШтрихкодыУпаковок.Добавить();
			
			СтрокаТЧ.ШтрихкодУпаковки	= Выборка.ШтрихкодУпаковки;	
			СтрокаТЧ.ШтрихкодКоробки    = Выборка.ШтрихкодКоробки;
		КонецЦикла;			
	КонецЕсли;	
КонецФункции //ЗаполнитьПоЗаданиеНаМаркировку(ПНК_Ссылка)

Функция ЗаполнитьПоЗаданиюНаСборку(ЗаданиеНаСборку)
	Запрос = Новый Запрос(Документы.ХранилищеКодовМаркировки.ТекстЗапроса_КМ_ПоЗаданиеНаСборку());
	Запрос.УстановитьПараметр("ЗаданиеНаСборку", ЗаданиеНаСборку);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() <= 95000 Тогда
		Пока Выборка.Следующий() Цикл
			СтрокаТЧ = ШтрихкодыУпаковок.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);			
		КонецЦикла;			
	КонецЕсли;	
КонецФункции //ЗаполнитьПоЗаданиеНаМаркировку(ПНК_Ссылка)

Функция ЗаполнитьПоПРМ(ПРМ_Ссылка)
	Запрос = Новый Запрос(Документы.ХранилищеКодовМаркировки.ТекстЗапроса_КМ_ПоДокументуОтгрузки_ЛН());
	Запрос.УстановитьПараметр("ПРМ_Ссылка", ПРМ_Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() <= 50000 Тогда
		Пока Выборка.Следующий() Цикл
			СтрокаТЧ = ШтрихкодыУпаковок.Добавить();
			СтрокаТЧ.ШтрихкодУпаковки = Выборка.ШтрихкодУпаковки;	
		КонецЦикла;			
	Иначе		
		ВызватьИсключение "Превышено макс. количество кодов маркировки на документ ! (Допустимое кол-во 50 000)";
	КонецЕсли;	
КонецФункции //ЗаполнитьПоПРМ(ПНК_Ссылка)

Функция ЗаполнитьТовары()
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ШК ИЗ &ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	|;	
	|ВЫБРАТЬ
	|	ШтрихКодУпаковки.Владелец	КАК Номенклатура,		
	|	СУММА(1) 					КАК Количество
	|ПОМЕСТИТЬ ВТ_НоменклатураПоШтукам
	|ИЗ
	|	ВТ_ШК	
	|ГДЕ
	|	ШтрихКодУпаковки.ТипКода <> ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка)	
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодУпаковки.Владелец
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихКодУпаковки КАК ШтрихКодКоробки
	|ИЗ
	|	ВТ_ШК	
	|ГДЕ
	|	ШтрихКодУпаковки.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка)
	|";
			
	Запрос.УстановитьПараметр("ШтрихкодыУпаковок", ШтрихкодыУпаковок);
	
	рЗапроса = Запрос.ВыполнитьПакет();   
	
	ШтрихКодыКоробок = рЗапроса[рЗапроса.ВГраница()].Выгрузить().ВыгрузитьКолонку("ШтрихКодКоробки");
	Если ШтрихКодыКоробок.Количество() > 0 Тогда		
		мВложенныеШК = Документы.МаркировкаТоваровИСМП.ПолучитьВложенныеКоды(ШтрихКодыКоробок);
		
		ВложенныеШК = Новый ТаблицаЗначений;
		ВложенныеШК.Колонки.Добавить("ШтрихКодУпаковки", Новый ОписаниеТипов("СправочникСсылка.ШтрихкодыУпаковокТоваров"));
		
		Для каждого ШтрихКодУпаковки Из мВложенныеШК Цикл
			СтрокаШК = ВложенныеШК.Добавить();
			СтрокаШК.ШтрихКодУпаковки = ШтрихКодУпаковки;
		КонецЦикла;
	
		Запрос.УстановитьПараметр("ВложенныеШК", ВложенныеШК);
		
		Запрос.Текст = "
		|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ВложенныеШК ИЗ &ВложенныеШК КАК ВложенныеШК
		|;
		|ВЫБРАТЬ
		|	Номенклатура		КАК Номенклатура,
		|	СУММА(Количество)	КАК Количество
		|ПОМЕСТИТЬ ВТ_НоменклатураХКМ
		|ИЗ
		|(
		|ВЫБРАТЬ
		|	ШтрихКодУпаковки.Владелец	КАК Номенклатура,
		|	1							КАК Количество
		|ИЗ
		|	ВТ_ВложенныеШК
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	Номенклатура				КАК Номенклатура,
		|	Количество					КАК Количество
		|ИЗ
		|	ВТ_НоменклатураПоШтукам
		|) КАК Сводный
		|СГРУППИРОВАТЬ ПО
		|	Номенклатура		
		|";
	Иначе
		Запрос.Текст = "		
		|ВЫБРАТЬ
		|	Номенклатура				КАК Номенклатура,
		|	Количество					КАК Количество
		|ПОМЕСТИТЬ ВТ_НоменклатураХКМ
		|ИЗ
		|	ВТ_НоменклатураПоШтукам		
		|";		
	КонецЕсли;	                     
	
	Запрос.Текст = Запрос.Текст + "
	|;
	|ВЫБРАТЬ
	|	Номенклатура 				КАК Номенклатура,
	|	МАКСИМУМ(Единицы.Ссылка) 	КАК Единица
	|ПОМЕСТИТЬ ВТ_Единицы
	|ИЗ
	|	ВТ_НоменклатураХКМ
	|ЛЕВОЕ СОЕДИНЕНИЕ	
	|	Справочник.Единицы КАК Единицы
	|ПО
	|	ВТ_НоменклатураХКМ.Номенклатура = Единицы.Владелец
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|ВЫБРАТЬ
	|	ВТ_НоменклатураХКМ.*,
	|	ВТ_Единицы.Единица,	
	|	1 КАК Коэффициент
	|ИЗ
	|	ВТ_НоменклатураХКМ
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТ_Единицы
	|ПО
	|	ВТ_НоменклатураХКМ.Номенклатура = ВТ_Единицы.Номенклатура
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_НоменклатураХКМ.Номенклатура.Наименование	
	|";	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Товары.Очистить();
	
	Пока Выборка.Следующий() Цикл		
		СтрокаТЧ = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
	КонецЦикла;

КонецФункции // ЗаполнитьТовары()

Функция лМожноЗаписатьДокумент()
	Результат = Новый Структура("Успешно,Ошибки", Истина, Новый Массив);
	
	Если ЭтоНовый() Тогда
		мКодУзлаСоздания = КодУзлаСоздания;
	Иначе 
		мКодУзлаСоздания = ПолучитьРеквизитШапки(Ссылка, "КодУзлаСоздания");
	КонецЕсли;		
		
	Если ОбменДанными.Загрузка Тогда
		УзелОтправитель = ОбменДанными.Отправитель;
		Если ЗначениеЗаполнено(УзелОтправитель) Тогда
			Если УзелОтправитель.Код <> мКодУзлаСоздания Тогда
				Если УзелОтправитель.Код = "CO_FR" Тогда
				Иначе					
					Результат.Успешно = Ложь;							
					Результат.Ошибки.Добавить("Нельзя перезаписывать ХКМ созданный в другом узле ! "+Ссылка+" создан: "+мКодУзлаСоздания);
				КонецЕсли;
			ИначеЕсли мКодУзлаСоздания = Маркировка_ПИ.ЭтотУзел_Код() Тогда
				Результат.Успешно = Ложь;							
				Результат.Ошибки.Добавить("Можно загружать только ХКМ созданные в других узлах ! "+ЭтотОбъект+" узел отправитель: "+УзелОтправитель.Код+", код узла создания: "+мКодУзлаСоздания);
			КонецЕсли; 			 
		КонецЕсли;
	Иначе
		Если НЕ ЭтоНовый() Тогда
			Если мКодУзлаСоздания<>Маркировка_ПИ.ЭтотУзел_Код() И Модифицированность() Тогда
				Результат.Успешно = Ложь;
				Результат.Ошибки.Добавить("Нельзя изменять ХКМ созданный в другом узле ! "+Ссылка+" создан: "+мКодУзлаСоздания);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ПараметрыСеанса.ОтключитьКонтрольДЗР Тогда 
			//Валетов + 17,07,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5947
		  //Если Дата <= КонецДня(ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования()) Тогда
		  Если Дата <= ОбщегоНазначения_ПИ.ПолучитьДатуЗапретаРедактирования_ПИ(ЭтотОбъект.Метаданные().Имя) Тогда 
			//Валетов -
			  Результат.Успешно = Ложь;
			  Результат.Ошибки.Добавить("Нарушение ДЗР !");
		  КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции // ()

Функция ПолучитьВыборкуВложенныхКодов()	
	Запрос = Новый Запрос;
	Запрос.Текст = " 	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ       
	|	ШтрихкодУпаковки
	|ИЗ	
	|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|	И (
	|		ШтрихкодУпаковки.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка) 
	//++Данилова Е.В. 16.12.2025  MARK-3378
	//|		ИЛИ ШтрихкодУпаковки.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)	
	//--Данилова Е.В. 16.12.2025
	|	)
	|";
	Запрос.УстановитьПараметр("ДокСсылка", Ссылка);
	
	мШтрихКоды = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШтрихкодУпаковки");
	
	тШК = Новый ТаблицаЗначений;
	тШК.Колонки.Добавить("ШтрихКодУпаковки", Новый ОписаниеТипов("СправочникСсылка.ШтрихкодыУпаковокТоваров"));

	Для Каждого ШтрихКодУпаковки Из Документы.МаркировкаТоваровИСМП.ПолучитьВложенныеКоды(мШтрихКоды) Цикл
		СтрокаТ = тШК.Добавить();
		СтрокаТ.ШтрихкодУпаковки = ШтрихкодУпаковки;
	КонецЦикла;  
	
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ШК ИЗ &тШК КАК тШК
	|;                                        
	|ВЫБРАТЬ РАЗЛИЧНЫЕ       
	|	ШтрихкодУпаковки
	|ПОМЕСТИТЬ ВТ_ДанныеТЧ
	|ИЗ	
	|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|ИНДЕКСИРОВАТЬ ПО
	|	ШтрихкодУпаковки
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ШК.ШтрихКодУпаковки						КАК ШтрихКодУпаковки,
	|	ВТ_ШК.ШтрихКодУпаковки.ТипШК 				КАК ТипШК,
	//+++Чирков 21.08.2025 выравнивание движений по статусам в регистрах штук и коробок	
	|	ВТ_ШК.ШтрихКодУпаковки.СпособВводаВОборот 	КАК СпособВводаВОборот,
	//---Чирков 21.08.2025 выравнивание движений по статусам в регистрах штук и коробок
	//+++Чирков 29.09.2025 выравнивание движений по статусам в регистрах штук и коробок
	|	ВТ_ШК.ШтрихКодУпаковки.ТипУпаковки 			КАК ТипУпаковки,                            
	//--Чирков 29.09.2025 выравнивание движений по статусам в регистрах штук и коробок
	|	ВЫБОР 
	|		КОГДА ВТ_ШК.ШтрихкодУпаковки.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар) 
	|			ТОГДА ВТ_ШК.ШтрихкодУпаковки.Владелец
	|		КОГДА ВТ_ШК.ШтрихкодУпаковки.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор) 
	|			ТОГДА ВТ_ШК.ШтрихкодУпаковки.Владелец
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)	
	|	КОНЕЦ							КАК Номенклатура	
	|ИЗ
	|	ВТ_ШК              
	//Из-за буйных фантазий Крохина и Нечаевой - нужно проверять не напихали-ли какого-нибудь мусора в ТЧ
	|ЛЕВОЕ СОЕДИНЕНИЕ	
	|	ВТ_ДанныеТЧ
	|ПО            
	|	ВТ_ДанныеТЧ.ШтрихКодУпаковки = ВТ_ШК.ШтрихКодУпаковки
	|ГДЕ
	|	ВТ_ДанныеТЧ.ШтрихКодУпаковки ЕСТЬ NULL 
	|";	
	
	Запрос.УстановитьПараметр("тШК", тШК);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции //ПолучитьВыборкуВложенныхКодов()

Функция ЭтоСкладКарантина(Склад)
	Если ЗначениеЗаполнено(Склад) Тогда
		Результат = ПолучитьРеквизитШапки(Склад, "КарантинЧЗ", "Справочник");
	Иначе
		Результат = Ложь;
	КонецЕсли;
	Возврат Результат;
КонецФункции //ЭтоСкладКарантина(Склад)

Функция ЗаполнитьОтправителяПолучателя() Экспорт
	рПолучения = Документы.ХранилищеКодовМаркировки.ОпределитьОтправителяПолучателя(ДокОснование);
	
	Отправитель = рПолучения.Отправитель;
	Получатель	= рПолучения.Получатель;
КонецФункции //ЗаполнитьОтправителяПолучателя()

Функция РасформироватьКоробки(Местонахождение)
	//+++Чирков 21.08.2025 выравнивание движений по статусам в регистрах штук и коробок	
	СтатусКМ = Перечисления.СтатусыКодовМаркировкиФакт.Выбыл;
	
	Для Каждого СтрокаШК Из ПолучитьКодыКоробок() Цикл
		Движение = Движения.СтатусыКМ_Факт.Добавить();		
			
		Движение.Период 			= Дата;
			
		Движение.ШтрихКодУпаковки	= СтрокаШК.ШтрихкодКоробки;				
			
		Движение.Статус				= СтатусКМ;			
		Движение.ТипШК				= СтрокаШК.ТипШК;
		Движение.Местонахождение	= Местонахождение;			
		Движение.ВПути				= Ложь;
		
		Если СтрокаШК.ТипШК <> Перечисления.ТипыШтрихКодов.Штука Тогда
			Движение_Кор = Движения.СтатусыКМ_Факт_А.Добавить();
			ЗаполнитьЗначенияСвойств(Движение_Кор, Движение);
			
			Движение_Кор.СпособВводаВОборот = СтрокаШК.СпособВводаВОборот;
			//+++Чирков 01.12.2025 ТипУпаковки - убираем
			//Движение_Кор.ТипУпаковки 		= СтрокаШК.ТипУпаковки;
			//---Чирков 01.12.2025
		КонецЕсли;
	КонецЦикла;
	//---Чирков 21.08.2025 выравнивание движений по статусам в регистрах штук и коробок	
КонецФункции //РасформироватьКоробки()
 
Функция ПолучитьКодыКоробок()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|	ВложенныеШтрихкоды.Ссылка 						КАК ШтрихкодКоробки,
	|	ВложенныеШтрихкоды.Ссылка.ТипШК 				КАК ТипШК,
	|	ВложенныеШтрихкоды.Ссылка.СпособВводаВОборот	КАК СпособВводаВОборот,
	|	ВложенныеШтрихкоды.Ссылка.ТипУпаковки			КАК ТипУпаковки	
	|ИЗ
	|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок КАК ШК_ХКМ
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШтрихкоды   	
	|ПО 
	|	ШК_ХКМ.ШтрихкодУпаковки = ВложенныеШтрихкоды.Штрихкод	                        
	//+++Чирков 13.01.2026 - задача MARK-3417 - исключить наборы
	|	И ВложенныеШтрихкоды.Ссылка.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка)
	//---Чирков 13.01.2026 - задача MARK-3417 - исключить наборы
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.СтатусыКМ_Факт КАК Статусы
    |ПО 
	|	ВложенныеШтрихкоды.Ссылка = Статусы.ШтрихКодУпаковки
	|	И Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Выбыл)	
	//+++Чирков 29.01.2026 - коробка выбывает 1 раз а коды из нее могут быть в нескольких ХКМ - если выбыла в другом документе - то этого достаточно
	//|	И Статусы.Период < &МоментВремени
	|	И Статусы.Регистратор <> &Ссылка
	//---Чирков 29.01.2026
	|ГДЕ
	|	ШК_ХКМ.Ссылка = &Ссылка	
	|	И Статусы.Статус ЕСТЬ NULL
	|УПОРЯДОЧИТЬ ПО
	|	ШтрихкодКоробки
	|";
	
	Запрос.УстановитьПараметр("МоментВремени", 	Дата);	
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);	
	
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции //ПолучитьКодыКоробок()
